---
type: PipeSegment
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 3
tags: [revit-api, class]
---

# PipeSegment

`Autodesk.Revit.DB.Plumbing.PipeSegment` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static PipeSegment Create ( Document ADocument , ElementId MaterialId , ElementId ScheduleId , ICollection < MEPSize > sizeSet )` |
| Property | Parameter | — | `` |
| Property | ScheduleTypeId | 2013 | `public ElementId ScheduleTypeId { get ; }` |